netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/api_getDataCenterUrls_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:platformMsgs="urn:messages_2014_1.platform.webservices.netsuite.com"
                  xmlns:platformCore="urn:core_2014_1.platform.webservices.netsuite.com"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <platformMsgs:preferences>
            <platformMsgs:warningAsError/>
            <platformMsgs:disableMandatoryCustomFieldValidation/>
            <platformMsgs:disableSystemNotesForCustomFields/>
            <platformMsgs:ignoreReadOnlyFields/>
        </platformMsgs:preferences>
        <platformMsgs:partnerInfo>
            <platformMsgs:partnerId/>
        </platformMsgs:partnerInfo>
        <platformMsgs:applicationInfo>
            <platformMsgs:applicationId/>
        </platformMsgs:applicationInfo>
        <platformMsgs:passport>
            <platformCore:email>%s(email)</platformCore:email>
            <platformCore:password>%s(password)</platformCore:password>
            <platformCore:account>%s(account)</platformCore:account>
            <platformCore:role>
                <platformCore:name></platformCore:name>
            </platformCore:role>
        </platformMsgs:passport>
    </soapenv:Header>
    <soapenv:Body>
        <platformMsgs:getDataCenterUrls>
            <platformMsgs:account></platformMsgs:account>
        </platformMsgs:getDataCenterUrls>
    </soapenv:Body>
</soapenv:Envelope>

